use std::{collections::HashMap, path::Path, sync::LazyLock};

use reqwest::{Client, IntoUrl};
use tokio::io::AsyncWriteExt;

static FACE_DICT: LazyLock<HashMap<&str, &str>> = LazyLock::new(|| {
    // 定义 face id 到文本的替换 {{{
    HashMap::from([
        ("4", "[/得意]"),
        ("5", "[/流泪]"),
        ("8", "[/睡]"),
        ("9", "[/大哭]"),
        ("10", "[/尴尬]"),
        ("12", "[/调皮]"),
        ("14", "[/微笑]"),
        ("16", "[/酷]"),
        ("21", "[/可爱]"),
        ("23", "[/傲慢]"),
        ("24", "[/饥饿]"),
        ("25", "[/困]"),
        ("26", "[/惊恐]"),
        ("27", "[/流汗]"),
        ("28", "[/憨笑]"),
        ("29", "[/悠闲]"),
        ("30", "[/奋斗]"),
        ("32", "[/疑问]"),
        ("33", "[/嘘]"),
        ("34", "[/晕]"),
        ("38", "[/敲打]"),
        ("39", "[/再见]"),
        ("41", "[/发抖]"),
        ("42", "[/爱情]"),
        ("43", "[/跳跳]"),
        ("49", "[/拥抱]"),
        ("53", "[/蛋糕]"),
        ("60", "[/咖啡]"),
        ("63", "[/玫瑰]"),
        ("66", "[/爱心]"),
        ("74", "[/太阳]"),
        ("75", "[/月亮]"),
        ("76", "[/赞]"),
        ("78", "[/握手]"),
        ("79", "[/胜利]"),
        ("85", "[/飞吻]"),
        ("89", "[/西瓜]"),
        ("96", "[/冷汗]"),
        ("97", "[/擦汗]"),
        ("98", "[/抠鼻]"),
        ("99", "[/鼓掌]"),
        ("100", "[/糗大了]"),
        ("101", "[/坏笑]"),
        ("102", "[/左哼哼]"),
        ("103", "[/右哼哼]"),
        ("104", "[/哈欠]"),
        ("106", "[/委屈]"),
        ("109", "[/左亲亲]"),
        ("111", "[/可怜]"),
        ("116", "[/示爱]"),
        ("118", "[/抱拳]"),
        ("120", "[/拳头]"),
        ("122", "[/爱你]"),
        ("123", "[/NO]"),
        ("124", "[/OK]"),
        ("125", "[/转圈]"),
        ("129", "[/挥手]"),
        ("144", "[/喝彩]"),
        ("147", "[/棒棒糖]"),
        ("171", "[/茶]"),
        ("173", "[/泪奔]"),
        ("174", "[/无奈]"),
        ("175", "[/卖萌]"),
        ("176", "[/小纠结]"),
        ("179", "[/doge]"),
        ("180", "[/惊喜]"),
        ("181", "[/骚扰]"),
        ("182", "[/笑哭]"),
        ("183", "[/我最美]"),
        ("201", "[/点赞]"),
        ("203", "[/托脸]"),
        ("212", "[/托腮]"),
        ("214", "[/啵啵]"),
        ("219", "[/蹭一蹭]"),
        ("222", "[/抱抱]"),
        ("227", "[/拍手]"),
        ("232", "[/佛系]"),
        ("240", "[/喷脸]"),
        ("243", "[/甩头]"),
        ("246", "[/加油抱抱]"),
        ("262", "[/脑阔疼]"),
        ("264", "[/捂脸]"),
        ("265", "[/辣眼睛]"),
        ("266", "[/哦哟]"),
        ("267", "[/头秃]"),
        ("268", "[/问号脸]"),
        ("269", "[/暗中观察]"),
        ("270", "[/emm]"),
        ("271", "[/吃瓜]"),
        ("272", "[/呵呵哒]"),
        ("273", "[/我酸了]"),
        ("277", "[/汪汪]"),
        ("278", "[/汗]"),
        ("281", "[/无眼笑]"),
        ("282", "[/敬礼]"),
        ("284", "[/面无表情]"),
        ("285", "[/摸鱼]"),
        ("287", "[/哦]"),
        ("289", "[/睁眼]"),
        ("290", "[/敲开心]"),
        ("293", "[/摸锦鲤]"),
        ("294", "[/期待]"),
        ("297", "[/拜谢]"),
        ("298", "[/元宝]"),
        ("299", "[/牛啊]"),
        ("305", "[/右亲亲]"),
        ("306", "[/牛气冲天]"),
        ("307", "[/喵喵]"),
        ("314", "[/仔细分析]"),
        ("315", "[/加油]"),
        ("318", "[/崇拜]"),
        ("319", "[/比心]"),
        ("320", "[/庆祝]"),
        ("322", "[/拒绝]"),
        ("324", "[/吃糖]"),
        ("326", "[/生气]"),
    ])
});
//}}}

pub fn face_to_str(face_id: &str) -> &'static str {
    FACE_DICT.get(face_id).unwrap_or(&"")
}

pub fn index_resource(index: &mut u64, f: &str) -> String {
    let s = format!("{index}_{f}");
    *index += 1;
    s
}

pub async fn download_resource(
    client: &Client,
    url: impl IntoUrl,
    file: String,
    cache: &Path,
) -> Result<String, crate::Error> {
    let res = client.get(url.into_url()?).send().await?;
    let bytes = res.error_for_status()?.bytes().await?;
    let mut filepath = cache.join(file);
    while filepath.exists()
        && let Some(basename) = filepath.file_name()
    {
        filepath.set_file_name(basename.to_string_lossy().to_string() + "_");
    }
    let mut file = tokio::fs::File::create(&filepath).await?;
    file.write_all(&bytes).await?;
    Ok(filepath
        .file_name()
        .unwrap_or_default()
        .to_string_lossy()
        .into())
}
